let handler  = async (m, { conn }) => {
conn.reply(m.chat,`*『${pickRandom(global.lw)}』*`, m)
}
handler.help = ['bzmzjdks']
handler.tags = ['fun']
handler.command = ['تحدي']
export default handler

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
} 

     global.lw = [                  "تناول شيئًا ولكن لا تستخدم يديك.",
                 'الغضب من أصدقائك الذين لا يأتون على الرغم من أن لديكم موعدًا للعب لعبة الحقيقة أو الجرأة معًا",
                 "اكسر البيضة برأسك!",
                 "تناول الأطعمة التي تم خلطها معاً وسيكون طعمها غريباً، ولكن تأكد من أن الأطعمة ليست مضرة بصحتك على المدى الطويل أو القصير.",
                 "ارقصوا مثل Girls' Generation للأولاد أمام الفصل، أو ارقصوا مثل Super Junior للفتيات.",
                 "ارفع سارية العلم بدون العلم.",
                 "التحدث عن الشخص الذي يعجبك، وعن أصدقائك المقربين، وعن الجنس الآخر الذي لا تعرفه على الإطلاق، وأشياء من هذا القبيل.",
                 "نسخ جميع قصات شعر أصدقائك.",
                 "غناء أغنية HAI TAYO أمام العديد من الناس أثناء الرقص"،,
                 "غنّي أغنية Baby Shark بصوت عالٍ في الفصل الدراسي.",
                 "استعارة شيء من الجيران"،,
                 "اطلب توقيع أحد أعنف المعلمين بينما تقول أنت حقًا أكثر شخص معجب به في العالم.",
                 "اطلب من شخص ما (عشوائيًا) الحصول على المال في الشارع قائلاً ليس لدي المال حتى أحصل على كيس شيبسي"."،,
                 "اشرب شيئًا تم إعداده/الاتفاق عليه، لكن تأكد أنه ليس خطيرًا، يمكن أن يكون مثل شرب شراب ممزوج بصلصة الصويا.",
                 "بالتحدث إلى الرمز التعبيري الذي يخيف الشخص الذي يعجبك، لا بأس في التحدث إلى ما تريد، بأي وسيلة ممكنة.",
                 "غنِ فيلم ديزني المفضل لديك خارج المنزل وأنت تصرخ.",
                 "قم بتسمية 1 أزرق إلى 20 أزرق بسرعة ويجب ألا ترتكب أي أخطاء. إذا كان خطأ يجب تكراره من البداية.",
                 "ضع تاجًا ورقيًا وقل لكل من في الغرفة شرف للملك بينما تشير إلى كل شخص بالمسطرة.",
                 "ارتدي بنطالك مرة أخرى حتى صباح اليوم التالي.",
                 "عانق الشخص الذي لا تحبه في الفصل وقل له: شكرًا جزيلاً لكونك أفضل شخص بالنسبة لي".,
                 "اذهب إلى ميدان واسع، ثم اركض بأسرع ما يمكن بينما تقول: أنا مجنون، أنا مجنون.",
                 "اختر زهرة ثم قم بمطابقتها مع شخص لا تعرفه (يجب أن يكون من الجنس الآخر)",
                 "اختر شخصًا عشوائيًا في الشارع، ثم قل : أنت لا تعرف أنك جميل (على موقع One Direction)،",
                 "التظاهر بالامتلاك، على سبيل المثال: استحواذ النمر، وما إلى ذلك."،,
                 "اطلب منه أن يصفّر لأن فمه امتلأ بالطعام مرة أخرى.",
                 "اطلب أن تكون نادلًا لخدمتك مع أصدقائك على الغداء.",
                 "أخبرهم أن يستخدموا الجوارب لصنع القفازات.",
                 "اطلب منهم أن يرتدوا أغرب قبعة/الخوذة الأكثر سخافة خلال الجولة القادمة.",
                 "اتصل بوالدتك وقل لها: أمي، أريد أن أتزوج في أقرب وقت ممكن".,
                 "`اتصل بحبيبك السابق وقل له `أفتقدك"",
                 "قم بتغيير الملابس مع أقرب شخص حتى الجولة التالية.",
                 "تحديث الحالة في الواتس اب لأي شيء يبدأ بحرف S",
                 "قم بتحميل فيديو غنائي على YouTube يغني فيه أغانٍ مشهورة.",
                 "لوني أظافرك وأظافر قدميك بألوان مختلفة لمدة أسبوع.",
                 "تناول ملعقتين أرز بدون زينة",
                 "أرسل الرموز التعبيرية '🦄💨' في كل مرة تكتب فيها في مجموعة لمدة يوم واحد"،,
                 "قل مرحبًا بك في من يريد أن يصبح مليونيرًاا لجميع المجموعات لديك،",
                 "غناء جوقة الأغنية الأخيرة التي قمت بتشغيلها"،,
                 'أرسل صوتًا صوتيًا إلى حبيبتك السابقة/حبيبتك/صديقتك السابقة، وقل مرحبًا (الاسم)، أريد الاتصال بك، لحظة واحدة فقط. أفتقدك🥺👉🏼👉🏼'،,
                 'أخبر أشخاصًا عشوائيين: في البداية اخبرهم أنك توأم مفقود، ثم انفصلنا، ثم أجريت جراحة تجميلية. وهكذا',
                 'اصنع قافية واحدة للاعب الأول!',
                 'أخبرنا نسختك الخاصة من الأشياء المخزية'،,
                 'تغيير الاسم إلى`مثلي الجنس` لمدة 24 ساعة'،,
                 'اذكر نوع صديقتك!',
                 'قل `أنا أحبك، هل تريد أن تكون صديقي أم لا` إلى آخر جنس آخر تحدثت معه على الواتساب، انتظر ردهم'.,
                 'تحدث الى حبيبك السابق عبر تطبيق WHATSAPP وقل له انا افتقدك وارسل لقطة شاشة دليلا على انجازك للتحدي'
   
 ] 
